Revit 2027 API
ExternalServices.BuiltInExternalServices.RebarSpliceService Property
 Autodesk Internal: The service for spliping a rebar.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId RebarSpliceService { get; }
Public Shared ReadOnly Property RebarSpliceService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ RebarSpliceService {
	ExternalServiceId^ get ();
}
static member RebarSpliceService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace